tap 'homebrew/cask-drivers'
tap 'epk/epk'
tap 'microsoft/mssql-release https://github.com/Microsoft/homebrew-mssql-release'

brew 'autoconf'
brew 'automake'
brew 'composer'
brew 'dnsmasq'
brew 'gh'
brew 'libtool'
brew 'mackup'
brew 'mas'
brew 'nginx'
brew 'node'
brew 'php'
brew 'php@7.3'
brew 'php@7.4'
brew 'starship'
brew 'trash'
brew 'tree'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask '1password'
cask 'alfred'
cask 'discord'
cask 'docker'
cask 'fantastical'
cask 'figma'
cask 'firefox'
cask 'font-sf-mono-nerd-font'
cask 'github'
cask 'google-chrome'
cask 'helo'
cask 'iterm2'
cask 'kaleidoscope'
cask 'nordvpn'
cask 'nova'
cask 'parallels'
cask 'setapp'
cask 'slack'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'visual-studio-code'

mas 'Moom', id: 419330170
mas 'NordVPN IKE - Unlimited VPN', id: 1116599239
mas 'Things 3', id: 904280696
